In [5]:
import sqlalchemy as db
from getpass import getpass

In [6]:
password = getpass("Mysql Password: ")

Mysql Password: ········

In [7]:
dbName = "Publications"
connectionData = f"mysql+pymysql://root:{password}@localhost/{dbName}"

In [8]:
engine = db.create_engine(connectionData)
print("Connected to server!")

Connected to server!

In [9]:
import pandas as pd

In [10]:
ejercicio1 = pd.read_sql_query("""
SELECT a.au_id AUTHOR_ID, a.au_lname LAST_NAME, a.au_fname FIRST_NAME, t.title AS TITLE, p.pub_name AS PUBLISHER
	FROM authors AS a
	INNER JOIN titleauthor AS ta ON a.au_id = ta.au_id
    INNER JOIN titles AS t ON ta.title_id = t.title_id
    INNER JOIN publishers AS p ON t.pub_id = p.pub_id
""", engine)
ejercicio1.head()

,AUTHOR_ID,LAST_NAME,FIRST_NAME,TITLE,PUBLISHER
0,213-46-8915,Green,Marjorie,The Busy Executive's Database Guide,Algodata Infosystems
1,409-56-7008,Bennet,Abraham,The Busy Executive's Database Guide,Algodata Infosystems
2,267-41-2394,O'Leary,Michael,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
3,724-80-9391,MacFeather,Stearns,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
4,213-46-8915,Green,Marjorie,You Can Combat Computer Stress!,New Moon Books

In [11]:
ejercicio2 = pd.read_sql_query("""
CREATE TEMPORARY TABLE  jose(
	SELECT a.au_id AUTHOR_ID, a.au_lname LAST_NAME, a.au_fname FIRST_NAME, t.title AS TITLE, p.pub_name AS PUBLISHER
	FROM authors AS a
	RIGHT JOIN titleauthor AS ta ON a.au_id = ta.au_id
    INNER JOIN titles AS t ON ta.title_id = t.title_id
    INNER JOIN publishers AS p ON t.pub_id = p.pub_id
);
""", engine)

ResourceClosedError: This result object does not return rows. It has been closed automatically.

In [12]:
ejercicio22 = pd.read_sql_query("""
select AUTHOR_ID, LAST_NAME, FIRST_NAME, PUBLISHER, COUNT(*) as TITLE_COUNT from jose
group by AUTHOR_ID, PUBLISHER, LAST_NAME, FIRST_NAME
""", engine)
ejercicio22

      AUTHOR_ID       LAST_NAME FIRST_NAME             PUBLISHER  TITLE_COUNT
0   213-46-8915           Green   Marjorie  Algodata Infosystems            1
1   409-56-7008          Bennet    Abraham  Algodata Infosystems            1
2   267-41-2394         O'Leary    Michael  Algodata Infosystems            1
3   724-80-9391      MacFeather    Stearns  Algodata Infosystems            1
4   213-46-8915           Green   Marjorie        New Moon Books            1
5   274-80-9391        Straight       Dean  Algodata Infosystems            1
6   712-45-1867    del Castillo      Innes      Binnet & Hardley            1
7   722-51-5454        DeFrance     Michel      Binnet & Hardley            1
8   899-46-2035          Ringer       Anne      Binnet & Hardley            1
9   238-95-7766          Carson     Cheryl  Algodata Infosystems            1
10  427-17-2319            Dull        Ann  Algodata Infosystems            1
11  846-92-7186          Hunter     Sheryl  Algodata Infosystems            1
12  486-29-1786        Locksley   Charlene  Algodata Infosystems            1
13  724-80-9391      MacFeather    Stearns      Binnet & Hardley            1
14  756-30-7391          Karsen      Livia      Binnet & Hardley            1
15  899-46-2035          Ringer       Anne        New Moon Books            1
16  998-72-3567          Ringer     Albert        New Moon Books            2
17  172-32-1176           White    Johnson        New Moon Books            1
18  486-29-1786        Locksley   Charlene        New Moon Books            1
19  807-91-6654        Panteley     Sylvia      Binnet & Hardley            1
20  648-92-1872  Blotchet-Halls   Reginald      Binnet & Hardley            1
21  267-41-2394         O'Leary    Michael      Binnet & Hardley            1
22  472-27-2349      Gringlesby       Burt      Binnet & Hardley            1
23  672-71-3249        Yokomoto      Akiko      Binnet & Hardley            1

In [17]:
ejercicio3 = pd.read_sql_query("""
SELECT a.au_id AUTHOR_ID, a.au_lname LAST_NAME, a.au_fname FIRST_NAME, SUM(s.qty) AS TOTAL
	FROM authors AS a
	INNER JOIN titleauthor AS ta ON a.au_id = ta.au_id
    INNER JOIN sales AS s ON ta.title_id = s.title_id
    Group by a.au_id
    order by TOTAL DESC
    Limit 3
""", engine)
ejercicio3.head()

     AUTHOR_ID LAST_NAME FIRST_NAME  TOTAL
0  899-46-2035    Ringer       Anne  148.0
1  998-72-3567    Ringer     Albert  133.0
2  213-46-8915     Green   Marjorie   50.0

In [18]:
ejercicio4 = pd.read_sql_query("""
SELECT a.au_id AUTHOR_ID, a.au_lname LAST_NAME, a.au_fname FIRST_NAME, SUM(s.qty) AS TOTAL
	FROM authors AS a
	LEFT JOIN titleauthor AS ta ON a.au_id = ta.au_id
    LEFT JOIN sales AS s ON ta.title_id = s.title_id
    Group by a.au_id
    order by TOTAL DESC
""", engine)
ejercicio4

      AUTHOR_ID       LAST_NAME   FIRST_NAME  TOTAL
0   899-46-2035          Ringer         Anne  148.0
1   998-72-3567          Ringer       Albert  133.0
2   213-46-8915           Green     Marjorie   50.0
3   846-92-7186          Hunter       Sheryl   50.0
4   427-17-2319            Dull          Ann   50.0
5   267-41-2394         O'Leary      Michael   45.0
6   724-80-9391      MacFeather      Stearns   45.0
7   807-91-6654        Panteley       Sylvia   40.0
8   722-51-5454        DeFrance       Michel   40.0
9   238-95-7766          Carson       Cheryl   30.0
10  486-29-1786        Locksley     Charlene   25.0
11  472-27-2349      Gringlesby         Burt   20.0
12  648-92-1872  Blotchet-Halls     Reginald   20.0
13  672-71-3249        Yokomoto        Akiko   20.0
14  756-30-7391          Karsen        Livia   20.0
15  172-32-1176           White      Johnson   15.0
16  274-80-9391        Straight         Dean   15.0
17  409-56-7008          Bennet      Abraham   15.0
18  712-45-1867    del Castillo        Innes   10.0
19  724-08-9931        Stringer         Dirk    NaN
20  527-72-3246          Greene  Morningstar    NaN
21  893-72-1158        McBadden      Heather    NaN
22  341-22-1782           Smith      Meander    NaN